# DimToInsertType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimToInsertType Property
ParameterTypeId Class See Also
---
"Dimension To Opening Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimToInsertType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimToInsertType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimToInsertType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace